{
    "news": [
        { "date": "2019-06-17",
          "title": "Fjords playtest over",
          "description": "The playtesting for the Fjords map is over. New games on Fjords v2.1 will no longer count as unranked; they will affect player ratings and show up in the statistics.",
          "type": "change"
        },
        { "date": "2018-08-26",
          "title": "New map, Fjords v2.1",
          "description": "<a href='https://terra.snellman.net/map/2afadc63f4d81e850b7c16fb21a1dcd29658c392'>Fjords v2.1</a> is available for playtesting, with just one hex swap compared to v2.0. Discussion on anything related to the map will happen on the <a href='https://boardgamegeek.com/thread/1750509/fjords'>map's BGG thread</a>. Please report back on your experiences after playing a few games. <b>Note: games on playtest maps will be unranked, and not affect the rating of any players</b>.",
          "type": "change"
        },
        { "date": "2018-03-31",
          "title": "Added map VP variants",
          "description": "Add support for the official 2017 starting VP variant. The variant shows up as a new map, <a href='https://terra-devel.snellman.net/map/91645cdb135773c2a7a50e5ca9cb18af54c664c4'>Original [2017 vp]</a>, when creating or joining a game. It will also be considered as a distinct map for all forms of statistics.",
          "type": "change"
        },
        { "date": "2018-01-11",
          "title": "New map, Fjords v2.0",
          "description": "<a href='https://terra.snellman.net/map/54919e13090127079e7cc3540ad0065311f2ecd7'>Fjords v2.0</a> is available for playtesting. Discussion on anything related to the map will happen on the <a href='https://boardgamegeek.com/thread/1750509/fjords'>map's BGG thread</a>. Please report back on your experiences after playing a few games. <b>Note: games on playtest maps will be unranked, and not affect the rating of any players</b>.",
          "type": "change"
        },
        { "date": "2017-10-08",
          "title": "New map, Fjords v1.0",
          "description": "<a href='https://terra.snellman.net/map/224736500d20520f195970eb0fd4c41df040c08c'>Fjords v1.0</a> is available for playtesting. Discussion on anything related to the map will happen on the <a href='https://boardgamegeek.com/thread/1750509/fjords'>map's BGG thread</a>. Please report back on your experiences after playing a few games. <b>Note: games on playtest maps will be unranked, and not affect the rating of any players</b>.",
          "type": "change"
        },
        { "date": "2017-08-05",
          "title": "Loon Lakes playtest over",
          "description": "The playtesting for the Loon Lakes map is over, with <a href='https://terra.snellman.net/map/fdb13a13cd48b7a3c3525f27e4628ff6905aa5b1'>v1.6</a> being the final version of the map. New games on that map version will no longer count as unranked; they will affect player ratings and show up in the statistics.",
          "type": "change"
        },
        { "date": "2017-02-19",
          "title": "New map, Loon Lakes v1.6",
          "description": "<a href='https://terra.snellman.net/map/fdb13a13cd48b7a3c3525f27e4628ff6905aa5b1'>Loon Lakes v1.6</a> has replaced the previous v1.5 for playtesting. Depending on feedback and results, we expect either v1.5 or v1.6 to be declared as the final design.",
          "type": "change"
        },
        { "date": "2016-10-24",
          "title": "New map, Loon Lakes v1.5",
          "description": "<a href='https://terra.snellman.net/map/c07f36f9e050992d2daf6d44af2bc51dca719c46'>Loon Lakes v1.5</a> has replaced the previous v1.3 for playtesting. Discussion on anything related to the map will happen on the <a href='https://boardgamegeek.com/thread/1603489/loon-lakes-map-name-subject-change'>map's BGG thread</a>. Please report back on your experiences after playing a few games. <b>Note: games on playtest maps will be unranked, and not affect the rating of any players</b>.",
          "type": "change"
        },
        { "date": "2016-08-03",
          "title": "New map, Loon Lakes v1.3",
          "description": "A <a href='https://terra.snellman.net/map/b8a54c8e8ea3f50867297da35be5c01b9a6791d2'>new map (Loon Lakes v1.3)</a> is available for initial playtesting. Discussion on anything related to the map will happen on the <a href='https://boardgamegeek.com/thread/1603489/loon-lakes-map-name-subject-change'>map's BGG thread</a>. Please report back on your experiences after playing a few games. <b>Note: games on playtest maps will be unranked, and not affect the rating of any players</b>.",
          "type": "change"
        },
        { "date": "2015-12-30",
          "title": "Chess clock",
          "description": "An alternate method for limiting the time taken for games is now available. The 'chess clock' method limits the total amount of time taken by a player for all their moves (with a certain initial amount of time, and some extra added each round).",
          "type": "change"
        },
        { "date": "2015-11-18",
          "title": "A rating system for asymmetric multiplayer games",
          "description": "A detailed look at the rating system used on this site. How does it work, why does it work like that, and could it be better? In fact, what does 'better' even mean when we talk about ratings, and how should rating systems be evaluated?",
          "type": "blog",
          "link": "https://www.snellman.net/blog/archive/2015-11-18-rating-system-for-asymmetric-multiplayer-games/"
        },
        { "date": "2015-10-23",
          "title": "Multi-faction planner",
          "description": "The planner can now be used to simulate moves of all factions in the game, not just your own. This is done using the <code>!plan</code> planning command. Additionally blocks of commands can be activated and deactivated by changing one line, with the <code>!if</code>, <code>!else</code> and <code>!endif</code> commands. See the <a href='/usage/#planning-commands'>planning commands</a> section of the manual for more information.",
          "type": "change"
        },
        { "date": "2015-10-19",
          "title": "Shapeshifter / Riverwalker official rules change",
          "description": "There is an <a href='https://boardgamegeek.com/thread/1456706/official-change-rules'>official rules change</a> to the Shapeshifters and Riverwalkers The original and playtest versions of these factions are no longer available.",
          "type": "change"
        },
        { "date": "2015-10-12",
          "title": "New round scoring tile",
          "description": "The round scoring tile from the new mini expansion is now available as an option. This scoring tile produces 4 points for building a temple on the correct round, and gives a end of round income of 2 coins per priests on the cult track 3/2-spaces.",
          "type": "change"
        },
        { "date": "2015-08-10",
          "title": "Shapeshifters / Riverwalkers v4",
          "description": "<p>New playtest versions of Shapeshifters and Riverwalkers.<ul><li><b>Shapeshifters v4</b>: The cost the Shapeshifter SH power has been increased to 4 power / 4 power tokens, and using the power no longer generates any victory points. They also have to pay one VP for every power token they receive using their faction special ability.<li><b>Riverwalkers v4</b>: Riverwalkers have to pay 2 coins when they unlock a new terrain on their wheel (starting terrain is free), 3 coins if it is another player's home terrain.</ul>",
          "type": "change"
        },
        { "date": "2015-07-22",
          "title": "Detecting players using multiple accounts",
          "description": "A blog post describing the system used for detecting people playing with multiple accounts.",
          "type": "blog",
          "link": "https://www.snellman.net/blog/archive/2015-07-22-cheater-detection-in-async-online-game/"
        },
        { "date": "2015-07-02",
          "title": "Changes to list of open games",
          "description": "The open game list will now only display games that the player viewing the list can join.",
          "type": "change"
        },
        { "date": "2015-05-06",
          "title": "Template games",
          "description": "When creating a new game, you can use an existing game as a template. This copies over the settings and the players (creating a private game) and automatically generates a game name, but lets you tweak the settings further if needed.",
          "type": "change"
        },
        { "date": "2015-05-01",
          "title": "Color blind mode",
          "description": "The game view now has a mode where a symbol is added to each map tile to indicate the color. You can toggle the mode on or off using the 'toggle color blind mode' link under the map. The setting is per-computer.",
          "type": "change"
        },
        { "date": "2015-04-28",
          "title": "Behavior of 'Next game' changed",
          "description": "The 'Next game' link now cycles through all the games waiting for a move, rather than going to the game that has been waiting the longest. If no games are waiting for a move from the user, the link will instead cycle through all games that are still running.",
          "type": "change"
        },
        { "date": "2015-03-07",
          "title": "Shapeshifters v3",
          "description": "The Shapeshifter playtest rules have been changed to limit the number of SH ability uses to the opponent count, not the player count. (Only applies to new games; games already in progress will continue using the previous rules).",
          "type": "change"
        },
        { "date": "2015-01-29",
          "title": "Playtesting for Shapeshifter rules change",
          "description": "The proposed rules changes to Shapeshifters (<a href='http://boardgamegeek.com/article/18027661#18027661'>source</a>) are now available for playtesting. With these rules, the Shapeshifters SH ability can only be used as many times as there are players in the game. They also have to pay one VP for every power token they receive using their faction special ability.",
          "type": "change"
        },
        { "date": "2014-12-12",
          "title": "'resign' command added",
          "description": "You can now resign from games using the 'resign' command. Note that the functionality is currently not available during faction selection. Use the feature with caution: you will be marked as having dropped out from the game on your profile page, and if the game finishes normally, might lose rating points based on your final position in the game.",
          "type": "change"
        },
        { "date": "2014-12-11",
          "title": "Time tracking",
          "description": "The time spent waiting for each player is now tracked in roughly 10 minute intervals. It does not matter whether the game is waiting on a full action or for a power leeching decision, nor whether there are otherplayers who should be entering moves at the moment. As a rule of thumb, if the game currently shows up as green or red on your game list, the clock is ticking. The timing information is displayed under the 'info' tab of each game.",
          "type": "change"
        },
        { "date": "2014-12-08",
          "title": "Command languages as game UIs",
          "description": "A blog post looking at the implications (feature set, usability, social effects and development issues) of using a command language as the canonical data representation both for the backend and the UI of this site.",
          "type": "blog",
          "link": "https://www.snellman.net/blog/archive/2014-12-08-command-languages-as-game-ui/"
        },
        { "date": "2014-11-27",
          "title": "A brief history of Online Terra Mystica",
          "description": "A development history of the site.",
          "type": "blog",
          "link": "https://www.snellman.net/blog/archive/2014-11-27-history-of-online-terra-mystica/"
        },
        { "date": "2014-11-27",
          "title": "Fire & Ice turn order variant",
          "type": "change",
          "description": "The turn order variant from Fire & Ice, where the order of passing determines the new turn order, is now available as a game creation option."
        },
        { "date": "2014-11-20",
          "title": "Email setting for game status changes",
          "type": "change",
          "description": "A new email setting can be used to turn off email notifications for games starting or ending."
        },
        { "date": "2014-11-15",
          "title": "Fire & Ice factions",
          "description": "The new factions from the Fire & Ice expansion are now available, and can be toggled on/off on a per-faction board basis during game creation."
        },
        { "date": "2014-10-24",
          "title": "Fire & Ice final scoring tiles available",
          "description": "The new final scoring tiles (randomly selected) are now available with the <code>fire-and-ice-final-scoring</code> game option."
        },
        { "date": "2014-10-22",
          "title": "Fire & Ice expansion maps available",
          "description": "You can select one of three maps when creating a new game; the original, or one of the two expansion maps."
        },
        { "date": "2014-09-05",
          "title": "Configurable move timers",
          "description": "The move timer, after which idle players are kicked from the game, can now be set at game creation time. Possible values range from 12 hours to 2 weeks. This option is available for both private and public games, but can not be changed after the game is created."
        },
        { "date": "2014-09-05",
          "title": "Rating limits for public games",
          "description": "It's now possible to create public games that can only be joined by players within a certain rating range."
        },
        { "date": "2014-04-27",
          "title": "Idle players dropped from games",
          "description": "Players who don't make their moves for a week are now automatically <a href='/usage/#drop'>dropped from the game</a>."
        },
        { "date": "2014-04-04",
          "title": "Detailed player statistics",
          "description": "A 'stats' tab has been added to the player info page, currently showing statistics of that player's games with different factions."
        },
        { "date": "2014-01-29",
          "title": "Idle games aborted after 2 weeks",
          "description": "Games that remain idle (with no moves entered) for over 2 weeks are automatically aborted. Aborted games can be restarted from the admin interface."
        },
        { "date": "2014-01-29",
          "title": "'abort' command removed",
          "description": "The 'abort' command no longer does anything. Use the 'abort' / 'restart' buttons under the 'Status' section instead."
        },
        { "date": "2013-12-18",
          "title": "Manual 'send email' feature obsoleted",
          "description": "The manual 'send email' functionality is no longer available, except for a few ongoing games. For PBEM games, please use the automatic email notification system."
        },
        { "date": "2013-12-17",
          "title": "UI Improvements",
          "description": "It's now possible to trigger the following operations by clicking on the map instead of through the menus: building, upgrading, forming towns with mermaids, using power actions / special actions. Hexes and action spaces that have an effect when clicked have a bright green border."
        },
        { "date": "2013-12-14",
          "title": "Ratings",
          "description": "A rating system system has been implemented. Please see the <a href='/ratings/'>ratings page</a> for an explanation on how it works."
        },
        { "date": "2013-12-07",
          "title": "Public games",
          "description": "There's now a new game type called 'public' game, in which the admin doesn't need to find a private group of people to play with. Instead anyone may join a 'public' game. You can join a public game through the list of <a href='/joingame/'>open games</a>."
        },
        { "date": "2013-12-05",
          "title": "Primary email address selection",
          "description": "Players with multiple registered email addresses can choose which address is the primary one (receives any notification messages). The selection can be made on the settings page. This change is retroactive -- one of the addresses has already been assigned as the primary for all existing users."
        },
        { "date": "2013-12-02",
          "title": "New UI for entering moves",
          "description": "<p>A crude graphical UI for move entry has been added for uses where entering text is difficult (for example phones). The original text-based interface will continue to be available. The UI is only available for entering real moves, not on the planning tab. <p>The interface is still a work in progress. Please let me know of any instances where it shows incorrect options. That is, suggests an invalid move or doesn't allow entering a valid one."
        },
        { "date": "2013-12-02",
          "title": "Improved game creation",
          "description": "Players can now be added to the game right from the game creation screen, either by email address or username, rather than require editing the game in admin mode."
        },
        { "date": "2013-12-02",
          "title": "Registration required",
          "description": "Games with unregistered players are no longer supported. Existing games with unregistered email addresses will continue working, but new ones can't be created."
        },
        { "date": "2013-11-23",
          "title": "Shipping bonus tile",
          "description": "The <a href='http://boardgamegeek.com/image/1843355/terra-mystica-navigation-round-bonus-tile'>shipping bonus tile</a> from Spielbox 6/2013 has been added. Enable it for new games with 'option shipping-bonus'. You can't enable the option for existing games."
        },
        { "date": "2013-11-12",
          "title": "More keyboard shortcuts",
          "description": "There are now keyboard shortcuts for switching between tabs in the game view. See the manual for the <a href='/usage/#keyboard-shortcuts'>list of keyboard shortcuts</a>."
        },
        { "date": "2013-11-11",
          "title": "In-game chat",
          "description": "Games now have a built-in chat system. The chat is only available for games with automatic email notifications turned on."
        },
        { "date": "2013-11-11",
          "title": "Email notifications",
          "description": "Games can now be created with automatic email notifications. Use 'option email-notify' to enable this feature. The feature is only available if all players have registered on the site. Players can control the notifications they receive from the settings page."
        },
        { "date": "2013-10-27",
          "title": "Mini expansion #1 (new town tiles)",
          "description": "The 4 mini-expansion tiles have been added. Use 'option mini-expansion-1' to enable them in new games."
        },
        { "date": "2013-07-22",
          "title": "Cultist errata",
          "description": "There has been an official rules change to the Cultists. If some opponents could gain power from a Cultist build / upgrade and they all decline it, the Cultists gain a power. This change will be on by default for new games ('option errata-cultist-power'), but doesn't apply to games that already started."
        },
        { "date": "2013-07-16",
          "title": "Recent moves",
          "description": "The 'recent' moves tab has been added. It shows all moves that happened in the game since your last full move."
        },
        { "date": "2013-07-15",
          "title": "'transform location' shorthand",
          "description": "The transform command can now be used without a color argument. This transforms the target location as close to your home terrain as possible given the remaining spades."
        },
        { "date": "2013-07-11",
          "title": "'done' command",
          "description": "The 'done' command can be used to forcibly end a turn. This is mostly useful in the planning tool."
        },
        { "date": "2013-07-06",
          "title": "'Display name'",
          "description": "The name given for a player in the game definition is no longer used for registered players. Instead the actual name of the player is used. You can change the name that is shown from the <a href='/settings/'>settings page</a>."
        },
        { "date": "2013-07-05",
          "title": "Player info",
          "description": "A player information page has been added for all regitered users. You can find the page by clicking on the name of the player in the game view, or at <code>/player/<i>username</i></code> ."
        },
        { "date": "2013-06-01",
          "title": "PBEM companion support removed",
          "description": "Support for the tmpbem companion app has been removed. Thanks to Gareth for writing it originally, and showing how inadequate the system was at the time."
        },
        { "date": "2013-05-26",
          "title": "Planning tool",
          "description": "A 'planning' tab has been added to the faction view. This can be used for entering notes to self, or entering a list of commands you intend to execute on future turns. In the latter case, you can also preview the effect of the plan."
        },        
        { "date": "2013-05-19",
          "title": "Dynamic favicon",
          "description": "The 'favicon', the little picture shown on the browser tab, is now gray if you have no moves to make and orange only if action is required. The information is updated every few minutes. Note -- does not work on Internet Explorer."
        },        
        { "date": "2013-05-15",
          "title": "'abort' command",
          "description": "The 'abort' command can be used to terminate a game halfway through."
        },        
        { "date": "2013-05-01",
          "title": "Linebreaks no longer matter",
          "description": "The move processing now ignores linebreaks in the commands input. Previously a linebreak indicated ending a turn, which occasionally confused people. Now the end of turn is automatically detected from the stream of individual commands."
        },
        { "date": "2013-04-27",
          "title": "Hexagons on cult track",
          "description": "The markers on the cult track will now be shown as hexagons if it's theoretically possible for that faction to advance to the top of the cult track. If not (no keys, top spot taken, etc) a circle is used instead."
        },
        { "date": "2013-04-25",
          "title": "Password reset",
          "description": "A password reset page function is now available from the login page."
        },
        { "date": "2013-04-25",
          "title": "'wait' command",
          "description": "The 'wait' command can be used to mark that you don't want to take an action until all the preceding actions have been resolved. Use it for example when you need to know whether somebody leeches power, before you take your own move."
        }
    ]
}
